{
  "name": "Balance Tuning",
  "description": "Automated balance tuning with sim-driven feedback loops. Orchestrator runs pre/post sims, detects regressions, checks convergence, and auto-generates backlog tasks from sim data. Agents receive structured BALANCE CONTEXT and work from auto-generated backlog.",
  "config": {
    "maxRounds": 20,
    "agentTimeoutMs": 1200000,
    "maxRuntimeMs": 14400000,
    "maxConcurrency": 3
  },
  "balanceConfig": {
    "sims": [
      { "tier": "bare", "variant": "balanced" },
      { "tier": "epic", "variant": "balanced" },
      { "tier": "giga", "variant": "balanced" }
    ],
    "matchesPerMatchup": 200,
    "simTimeoutMs": 60000,
    "runPreSim": true,
    "runPostSim": true,
    "regressionThresholdPp": 3,
    "convergenceCriteria": {
      "maxSpreadPp": { "bare": 15, "epic": 5, "giga": 7 },
      "maxFlags": 0,
      "requiredTiers": ["epic/balanced", "giga/balanced"],
      "minRounds": 3
    },
    "parameterSearch": {
      "configPath": "orchestrator/search-configs/quick-sweep.json",
      "timeoutMs": 300000
    }
  },
  "agents": [
    {
      "id": "balance-tuner",
      "name": "Balance Analyst",
      "type": "continuous",
      "role": "balance-analyst",
      "model": "sonnet",
      "maxModel": "opus",
      "timeoutMs": 1200000,
      "maxTasksPerRound": 2,
      "minFrequencyRounds": 0,
      "maxBudgetUsd": 5,
      "fileOwnership": ["src/engine/balance-config.ts", "src/engine/archetypes.ts", "src/tools/simulate.ts", "orchestrator/analysis/balance-sim-round-*.md"],
      "tasks": {
        "primary": "Read the BALANCE CONTEXT section (auto-injected by orchestrator) for current sim data — DO NOT run your own sims. If PARAMETER SEARCH RESULTS are provided, use them to prioritize which parameter to adjust (prefer changes the search identifies as improvements). Check BACKLOG TASKS for auto-generated tasks from sim analysis (outlier archetypes, regressions, matchup skews). Work backlog tasks in priority order. For each task: apply ONE small change (max +/-3 stat points or one constant), run tests, write analysis to orchestrator/analysis/balance-sim-round-{N}.md. If regressions were flagged, prioritize fixing them before new work. Reference exact numbers from BALANCE CONTEXT in your analysis.",
        "stretch": ["If all backlog tasks are done and balance is within targets, investigate the tier with the widest remaining spread"]
      }
    },
    {
      "id": "qa",
      "name": "QA Engineer",
      "type": "continuous",
      "role": "qa-engineer",
      "model": "sonnet",
      "maxModel": "opus",
      "timeoutMs": 1200000,
      "maxTasksPerRound": 2,
      "minFrequencyRounds": 0,
      "maxBudgetUsd": 5,
      "fileOwnership": ["src/engine/calculator.test.ts", "src/engine/match.test.ts", "src/engine/playtest.test.ts", "src/engine/gear-variants.test.ts", "src/engine/phase-resolution.test.ts"],
      "tasks": {
        "primary": "Check BACKLOG TASKS for QA tasks auto-generated by the orchestrator (companion tasks for balance changes). Write tests that validate balance changes: boundary conditions near changed parameter values, invariant preservation (stat pipeline order, gear budget sums, formula determinism). Read BALANCE CONTEXT for context on what changed. Do NOT run your own sims. Run full test suite to verify no regressions.",
        "stretch": ["Write property-based tests that sweep all 6 archetypes at the tier that had the most balance activity"]
      }
    },
    {
      "id": "reviewer",
      "name": "Tech Lead",
      "type": "continuous",
      "role": "tech-lead",
      "model": "sonnet",
      "maxModel": "sonnet",
      "timeoutMs": 900000,
      "maxTasksPerRound": 1,
      "minFrequencyRounds": 3,
      "maxBudgetUsd": 3,
      "fileOwnership": ["src/engine/types.ts", "CLAUDE.md"],
      "tasks": {
        "primary": "Review balance changes from balance-tuner. Read BALANCE CONTEXT for sim data (auto-injected). BLOCK if: change exceeds max magnitude (>5 stat pts), multiple changes per round, formula files modified, regression ignored. WARN if: change may overshoot (within 3pp of target), no hypothesis in analysis, spread trend already improving. Update CLAUDE.md with current archetype stats and win rates after verified changes."
      }
    }
  ]
}
